;; [[file:../../../gwp.note::bec6705d][bec6705d]]
(package! org)
(package! org-superstar)
(package! org-pdftools)
(package! org-download)
(package! org-noter)

;; for http api hacking
(package! restclient)
(package! ob-restclient)

(package! org-contrib
  :recipe (:host nil :repo "https://git.sr.ht/~bzg/org-contrib"))

;; for org-babel gnuplot
(package! gnuplot-mode)
(package! gnuplot)
;; bec6705d ends here
