;; [[file:../../../gwp.note::1dfc22ab][1dfc22ab]]
(package! crux)
(package! move-dup)
(package! simpleclip)
(package! keyfreq)
(package! command-log-mode)
(package! yasnippet)
(package! expand-region)
;; (package! goto-last-change)
(package! goto-chg)
;; 1dfc22ab ends here
